joshgoebel/hardware_arduboy/avr/boards.txt
menu.cpu=Speed

##############################################################

arduboy.name=Arduboy
arduboy.menu.cpu.speed8mhz=8Mhz
arduboy.menu.cpu.speed8mhz.build.f_cpu=8000000L
arduboy.menu.cpu.speed8mhz.bootloader.extended_fuses=0xcb
arduboy.menu.cpu.speed16mhz=16Mhz
arduboy.menu.cpu.speed16mhz.build.f_cpu=16000000L
arduboy.menu.cpu.speed16mhz.bootloader.extended_fuses=0xcb

arduboy.upload.tool=avrdude
arduboy.upload.protocol=avr109
arduboy.upload.maximum_size=28672
arduboy.upload.maximum_data_size=2560
arduboy.upload.speed=57600
arduboy.upload.disable_flushing=true
arduboy.upload.use_1200bps_touch=true
arduboy.upload.wait_for_upload_port=true

arduboy.bootloader.tool=arduino:avrdude
arduboy.bootloader.low_fuses=0xff
arduboy.bootloader.high_fuses=0xd8
#arduboy.bootloader.extended_fuses=0xcb
arduboy.bootloader.file=caterina/Caterina-Leonardo.hex
arduboy.bootloader.unlock_bits=0x3F
arduboy.bootloader.lock_bits=0x2F

arduboy.build.mcu=atmega32u4
arduboy.build.f_cpu=16000000L
arduboy.build.vid=0x2341
arduboy.build.pid=0x8036
arduboy.build.usb_product="Arduino Leonardo"
arduboy.build.board=AVR_LEONARDO
arduboy.build.core=arduino:arduino
arduboy.build.variant=arduino:leonardo
arduboy.build.extra_flags={build.usb_flags}
